## 프로세스와 스케줄러의 이해 - 프로세스간 커뮤니케이션

> 프로세스들이 서로의 공간을 쉽게 접근할 수 있다면? -> so dangerous

## 다양한 IPC(Inter Process Communication) 기법

1. FIle 사용
- file을 사용하면, 실시간으로 직접 원하는 프로세스에 데이터 전달이 어려움 -> 해당 프로세스가 파일을 읽어야 하는데 실시간으로 계속 읽고만 있을 수는 없다.
2. Message Queue
3. Shared Memory
4. Pipe
5. Signal
6. Semaphore
7. Socket

1번은 물리공간, 2번 부터는 모두 커널 공간을 사용하여 공유합니다.

## pipe(파이프)
- 기본 파이프는 단방향 통신
- fork()로 자식 프로세스를 만들었을 떄, 부모와 자식간의 통신을 할 수 있다.

## message queue(메시지 큐)
- 양방향 가능

## shared memory(공유 메모리)
- kernel space에 메모리 공간을 만들고, 해당 공간을 변수처럼 쓰는 방식
- message queue 처럼 FIFO방식이 아니라 해당 메모리 주소를 마치 변수처럼 접근하는 방식
- 공유메모리 key를 가지고 여러 프로세스가 접근 가능

## signal(시그널)
- 유닉스에서 30년 이상 사용된 전통적인 기법
- 커널 또는 프로세스에서 다른 프로세스에 어떤 이벤트가 발생되었는지를 알려주는 기법
- 프로세스 관련 코드에 관련 시그널 핸들러를 등록해서, 해당 시그널 처리 실행

### 주요 시그널
- SIGKILL: 프로세스를 죽여라
- SIGALARM: 알람을 발생한다.
- SIGSTP: 프로세스를 멈춰라
- SIGCONT: 멈춰진 프로세스를 실행해라
- SIGINT: 프로세스에 인터럽트를 보내서 프로세스를 죽여라
- SIGSEGV: 프로세스가 다른 메모리영역을 침범했다.

## socket(소켓)
- 소켓은 네트워크 통신을 위한 기술
- 기본적으로는 클라이언트와 서버등 두 개의 다른 컴퓨터간의 네트워크 기반 통신을 위한 기술
